app/controllers/invoices_controller.rb

SELECT "invoices".* FROM "invoices"
---
  def index
     @invoices = Invoice.all

SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @invoice = Invoice.find(params[:id])

SELECT  "invoices".* FROM "invoices"  ORDER BY "invoices"."number" DESC LIMIT 1
---
  def new

    last_invoice = Invoice.order(:number).last

SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT 1  [["id", 2]]
---
  def edit
    @invoice = Invoice.find(params[:id])

INSERT INTO "invoices" ("number", "total", "issue_date", "due_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @invoice = Invoice.new(invoice_params)
    if @invoice.save

SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT 1  [["id", nil]]
UPDATE "invoices" SET "issue_date" = $1, "updated_at" = $2 WHERE "invoices"."id" = $3  [["issue_date", "2015-12-01 00:00:00.000000"], ["updated_at", "2015-05-21 11:38:09.932148"], ["id", 1]]
---
  def update

    @invoice = Invoice.find(params[:id])


    if @invoice.update_attributes(invoice_params)

SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "invoices" WHERE "invoices"."id" = $1  [["id", 3]]
---
  def destroy
    @invoice = Invoice.find(params[:id])
    @invoice.destroy