app/controllers/invoices_controller.rb

  def set_extra
    @invoice = Invoice.find(params[:id])
---
SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT 1  [["id", 42]]